{"sections":{"main":{"type":"main-page","settings":{"padding_top":16,"padding_bottom":16}},"46d429f3-01f4-45e7-baef-db06656d7b8e":{"type":"rich-text","blocks":{"template--18313377022253__46d429f3-01f4-45e7-baef-db06656d7b8e-1679129517f2fd1b09-1":{"type":"text","settings":{"text":"<p>The Internet is an amazing tool. It has the power to change the way we live, and we're starting to see that potential today. With only a few mouse-clicks, you can follow the news, look up facts, buy goods and services, and communicate with others from around the world. It's important to Inkseekers.com to help our customers retain their privacy when they take advantage of all the Internet has to offer.<br\/> <\/p><p>We believe your business is no one else's. Your privacy is important to you…and to us. So we'll protect the information you share with us. To protect your privacy, Inkseekers.com follows different principles in accordance with world-wide practices for customer privacy and data protection.<\/p><p>We won’t sell or give away your name, mail address, phone number, email address, credit card number or any other information to anyone.<br\/><br\/>We’ll use state-of-the-art security measures to protect your information from unauthorized users.<br\/> <\/p>"}}},"block_order":["template--18313377022253__46d429f3-01f4-45e7-baef-db06656d7b8e-1679129517f2fd1b09-1"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"background-1","full_width":true,"padding_top":64,"padding_bottom":64}},"41dee106-8723-413c-b09c-6d4686842f22":{"type":"rich-text","blocks":{"24401b93-4b68-4483-82b6-63bcdcc8e3e7":{"type":"heading","settings":{"heading":"What we do with the information you share","heading_size":"h1"}},"b89cebed-f46f-4bb2-a586-fe9e216fdc8f":{"type":"text","settings":{"text":"<p>When you join us, you provide us with your contact information, including your name and email address. We use this information to send you updates about your order, questionnaires to measure your satisfaction with our service and announcements about new and exciting services that we offer. When you order from us, we ask for your credit card number and billing address. <\/p>"}}},"block_order":["24401b93-4b68-4483-82b6-63bcdcc8e3e7","b89cebed-f46f-4bb2-a586-fe9e216fdc8f"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"background-1","full_width":true,"padding_top":64,"padding_bottom":64}},"18b5dcb6-b9aa-4677-ae3a-122ca8a5ae65":{"type":"rich-text","blocks":{"8f8af6cf-5f9e-47e2-80c5-253d018f2abb":{"type":"heading","settings":{"heading":"For any questions please email <a href=\"mailto:support@Inkseekers.com\" title=\"mailto:support@Inkseekers.com\">support@Inkseekers.com<\/a>.","heading_size":"h1"}},"53bf46ef-40af-42ea-a480-1df5f9f1cd3c":{"type":"text","settings":{"text":"<p>If you wish to opt out please follow the procedures above.”<\/p><p>We occasionally hire other companies to provide limited services on our behalf, including packaging, mailing and delivering purchases, answering customer questions about products or services, sending postal mail and processing event registration. We will only provide those companies the information they need to deliver the service, and they are prohibited from using that information for any other purpose.<\/p><p>Inkseekers.com will disclose your personal information, without notice, only if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Inkseekers.com or the site; (b) protect and defend the rights or property of Inkseekers.com and its family of Web sites, and, (c) act in urgent circumstances to protect the personal safety of users of Inkseekers.com, its Web sites, or the public.<\/p>"}}},"block_order":["8f8af6cf-5f9e-47e2-80c5-253d018f2abb","53bf46ef-40af-42ea-a480-1df5f9f1cd3c"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"background-1","full_width":true,"padding_top":64,"padding_bottom":64}}},"order":["main","46d429f3-01f4-45e7-baef-db06656d7b8e","41dee106-8723-413c-b09c-6d4686842f22","18b5dcb6-b9aa-4677-ae3a-122ca8a5ae65"]}